sergev/LiteBSD/sys/mips/pic32/machdep.c
/*
 * Check whether button 1 is pressed.
 */
static inline int
button1_pressed()
{
#ifdef BUTTON1
    gpio_set_input(BUTTON1);
    return gpio_get(BUTTON1);
#else
    return 0;
#endif
}

/*
 * Do all the stuff that locore normally does before calling main().
 */
void
mach_init()
{
    int i;
    unsigned firstaddr;
    caddr_t v, start;
    extern char __data_start[], _edata[], _end[];
    extern void _etext(), _tlb_vector();

    /* Initialize STATUS register: master interrupt disable.
     * Setup interrupt vector base. */
    mtc0_Status(MACH_Status_CU0 | MACH_Status_BEV);
    mtc0_EBase(_tlb_vector);
    mtc0_Status(MACH_Status_CU0);

    /* Set vector spacing: not used really, but must be nonzero. */
    mtc0_IntCtl(32);

    /* Clear CAUSE register: use special interrupt vector 0x200. */
    mtc0_Cause(MACH_Cause_IV);

    /* Copy .data image from flash to RAM.
     * Linker places it at the end of .text segment. */
    bcopy(_etext, __data_start, _edata - __data_start);

    /* Clear .bss segment. */
    v = (caddr_t)mips_round_page(_end);
    bzero(_edata, v - _edata);

    /*
     * Assign console pins, board specific.
     */
#if defined(MEBII)
    /* Microchip MEB-II board: use UART1 for console.
     * Map signals rx=RA14, tx=RA15 to pins 4,6 at PICtail connector. */
    U1RXR = 13;             /* Group 1: 1101 = RA14 */
    RPA15R = 1;             /* Group 2: 0001 = U1TX */
#endif

#if defined(Whitecat)
    /* ECMB Board: use UART1 for console.
     * Map signals rx=RF4, tx=RF5. */
    U1RXR = 2;              /* Group 1: 0010 = RF4  */
    RPF5R = 1;              /* Group 2: 0001 = U1TX */
#endif

#if defined(HMZ144)
    /* Olimex HMZ144 Board: use UART2 for console.
     * Map signals rx=RE9, tx=RE8. */
    ANSELECLR = (1 << 8) |
                (1 << 9);   /* Set digital mode for RE8 and RE9 */
    U2RXR = 13;             /* Group 3: 1101 = RE9 */
    RPE8R = 2;              /* Group 4: 0010 = U2TX */
#endif

    /*
     * Autoboot by default.
     */
    boothowto = 0;
    if (button1_pressed()) {
        /* Boot to single user mode. */
        boothowto |= RB_SINGLE;
    }

    /*
     * Init mapping for u page(s) for proc[0], pm_tlbpid 1.
     */
    start = v;
    proc0paddr = (struct user *)v;
    curproc->p_addr = proc0paddr;
    curproc->p_md.md_regs = proc0paddr->u_pcb.pcb_regs;
    firstaddr = MACH_VIRT_TO_PHYS(v);
    for (i = 0; i < UPAGES; i++) {
        curproc->p_md.md_upte[i] = PG_PFNUM(firstaddr) | PG_UNCACHED | PG_V | PG_D;
        firstaddr += NBPG;
    }
    tlb_write_wired(0, UADDR | 1, curproc->p_md.md_upte[0],
                                  curproc->p_md.md_upte[1]);
    v += UPAGES * NBPG;
    tlb_set_pid(1);

    /*
     * init nullproc for swtch_exit().
     * init mapping for u page(s), pm_tlbpid 0
     * This could be used for an idle process.
     */
    nullproc.p_addr = (struct user *)v;
    nullproc.p_md.md_regs = nullproc.p_addr->u_pcb.pcb_regs;
    bcopy("nullproc", nullproc.p_comm, sizeof("nullproc"));
    for (i = 0; i < UPAGES; i++) {
        nullproc.p_md.md_upte[i] = PG_PFNUM(firstaddr) | PG_UNCACHED | PG_V | PG_D;
        firstaddr += NBPG;
    }
    v += UPAGES * NBPG;

    /* clear pages for u areas */
    bzero(start, v - start);

    switch (DEVID & 0x0fffffff) {
    case 0x05104053: strcpy(cpu_model, "PIC32MZ2048ECG064"); break;
    case 0x0510E053: strcpy(cpu_model, "PIC32MZ2048ECG100"); break;
    case 0x05118053: strcpy(cpu_model, "PIC32MZ2048ECG124"); break;
    case 0x05122053: strcpy(cpu_model, "PIC32MZ2048ECG144"); break;
    case 0x05109053: strcpy(cpu_model, "PIC32MZ2048ECH064"); break;
    case 0x05113053: strcpy(cpu_model, "PIC32MZ2048ECH100"); break;
    case 0x0511D053: strcpy(cpu_model, "PIC32MZ2048ECH124"); break;
    case 0x05127053: strcpy(cpu_model, "PIC32MZ2048ECH144"); break;
    case 0x05131053: strcpy(cpu_model, "PIC32MZ2048ECM064"); break;
    case 0x0513B053: strcpy(cpu_model, "PIC32MZ2048ECM100"); break;
    case 0x05145053: strcpy(cpu_model, "PIC32MZ2048ECM124"); break;
    case 0x0514F053: strcpy(cpu_model, "PIC32MZ2048ECM144"); break;
    default:         sprintf(cpu_model, "PIC32MZ DevID %08x", DEVID);
    }

    /*
     * Find out how much memory is available.
     */
    physmem = btoc(512 * 1024);

    /*
     * Initialize error message buffer (at end of core).
     */
    msgbufp = (struct msgbuf *)MACH_PHYS_TO_UNCACHED(mips_ptob(physmem)) - 1;
    msgbufmapped = 1;

    /*
     * Allocate space for system data structures.
     * The first available kernel virtual address is in "v".
     * As pages of kernel virtual memory are allocated, "v" is incremented.
     *
     * These data structures are allocated here instead of cpu_startup()
     * because physical memory is directly addressable. We don't have
     * to map these into virtual address space.
     */
    start = v;

#define valloc(name, type, num) \
        (name) = (type *)v; v = (caddr_t)((name)+(num))
#define valloclim(name, type, num, lim) \
        (name) = (type *)v; v = (caddr_t)((lim) = ((name)+(num)))

    valloc(callout, struct callout, ncallout);

    nswapmap = maxproc * 2;
    valloc(swapmap, struct map, nswapmap);

#ifdef SYSVSHM
    valloc(shmsegs, struct shmid_ds, shminfo.shmmni);
#endif

    /*
     * Determine how many buffers to allocate.
     * We allocate more buffer space than the BSD standard of
     * using 10% of memory for the first 2 Meg, 5% of remaining.
     * We just allocate a flat 10%.  Ensure a minimum of 16 buffers.
     * We allocate 1/2 as many swap buffer headers as file i/o buffers.
     */
    if (bufpages == 0)
        bufpages = physmem / 10 / CLSIZE;
    if (nbuf == 0)
        nbuf = 16;
    if (bufpages < nbuf)
        bufpages = nbuf;
    if (nswbuf == 0)
        nswbuf = 4;                     /* even */
    valloc(swbuf, struct buf, nswbuf);
    valloc(buf, struct buf, nbuf);

    /*
     * Clear allocated memory.
     */
    bzero(start, v - start);

    /*
     * Initialize the virtual memory system.
     * As argument, pass the first page address following the system data.
     */
    pmap_bootstrap((vm_offset_t)v);

