sergev/LiteBSD/sys/mips/pic32/machdep.c
    /*
     * Setup interrupt controller.
     *
     * Priority IRQ                     Devices
     * --------------------------------------------------------------
     *  1       Software interrupt 0    low-priority clock processing
     *  2       Software interrupt 1    network protocol processing
     *  3       SPI ports               disk controllers
     *  4       Ethernet                network device controllers
     *  5       UART ports              terminal multiplexers
     *  6       Core timer              high-priority clock processing
     */
    INTCON = 0;				/* Interrupt Control */
    IPTMR = 0;				/* Temporal Proximity Timer */

    /* Interrupt Flag Status */
    IFS(0) = 0;
    IFS(1) = 0;
    IFS(2) = 0;
    IFS(3) = 0;
    IFS(4) = 0;
    IFS(5) = 0;

    /* Interrupt Enable Control */
    IEC(0) = 0;
    IEC(1) = 0;
    IEC(2) = 0;
    IEC(3) = 0;
    IEC(4) = 0;
    IEC(5) = 0;

    /* Interrupt Priority Control */
#define LSW0    1       /* level for soft timer interrupts */
#define LSW1    2       /* level for soft network interrupts */
#define LSPI    3       /* level for SPI interrupts */
#define LETH    4       /* level for Ethernet interrupts */
#define LUART   5       /* level for UART interrupts */
#define LTMR    6       /* level for timer interrupts */

    /* 0 - Core Timer Interrupt
     * 1 - Core Software Interrupt 0
     * 2 - Core Software Interrupt 1
     * 3 - External Interrupt 0 */
    IPC(0) = PIC32_IPC_IP(LTMR, LSW0, LSW1, 0);
    IPC(1) = 0;
    IPC(2) = 0;
    IPC(3) = 0;
    IPC(4) = 0;
    IPC(5) = 0;
    IPC(6) = 0;
    IPC(7) = 0;
    IPC(8) = 0;
    IPC(9) = 0;
    IPC(10) = 0;
    IPC(11) = 0;
    IPC(12) = 0;
    IPC(13) = 0;
    IPC(14) = 0;
    IPC(15) = 0;
    IPC(16) = 0;
    IPC(17) = 0;
    IPC(18) = 0;
    IPC(19) = 0;
    IPC(20) = 0;
    IPC(21) = 0;
    IPC(22) = 0;
    IPC(23) = 0;
    IPC(24) = 0;
    IPC(25) = 0;
    IPC(26) = 0;

    /* 108 - Reserved
     * 109 - SPI1 Fault
     * 110 - SPI1 Receive Done
     * 111 - SPI1 Transfer Done */
    IPC(27) = PIC32_IPC_IP(0, LSPI, LSPI, LSPI);

    /* 112 - UART1 Fault
     * 113 - UART1 Receive Done
     * 114 - UART1 Transfer Done
     * 115 - I2C1 Bus Collision Event */
    IPC(28) = PIC32_IPC_IP(LUART, LUART, LUART, 0);
    IPC(29) = 0;
    IPC(30) = 0;
    IPC(31) = 0;
    IPC(32) = 0;
    IPC(33) = 0;
    IPC(34) = 0;

    /* 140 - DMA Channel 6
     * 141 - DMA Channel 7
     * 142 - SPI2 Fault
     * 143 - SPI2 Receive Done */
    IPC(35) = PIC32_IPC_IP(0, 0, LSPI, LSPI);

    /* 144 - SPI2 Transfer Done
     * 145 - UART2 Fault
     * 146 - UART2 Receive Done
     * 147 - UART2 Transfer Done */
    IPC(36) = PIC32_IPC_IP(LSPI, LUART, LUART, LUART);

    IPC(37) = 0;

    /* 152 - Control Area Network 2
     * 153 - Ethernet Interrupt
     * 154 - SPI3 Fault
     * 155 - SPI3 Receive Done */
    IPC(38) = PIC32_IPC_IP(0, LETH, LSPI, LSPI);

    /* 156 - SPI3 Transfer Done
     * 157 - UART3 Fault
     * 158 - UART3 Receive Done
     * 159 - UART3 Transfer Done */
    IPC(39) = PIC32_IPC_IP(LSPI, LUART, LUART, LUART);

    /* 160 - I2C3 Bus Collision Event
     * 161 - I2C3 Slave Event
     * 162 - I2C3 Master Event
     * 163 - SPI4 Fault */
    IPC(40) = PIC32_IPC_IP(0, 0, 0, LSPI);

    /* 164 - SPI4 Receive Done
     * 165 - SPI4 Transfer Done
     * 166 - Real Time Clock
     * 167 - Flash Control Event */
    IPC(41) = PIC32_IPC_IP(LSPI, LSPI, LTMR, 0);

    /* 168 - Prefetch Module SEC Event
     * 169 - SQI1 Event
     * 170 - UART4 Fault
     * 171 - UART4 Receive Done */
    IPC(42) = PIC32_IPC_IP(0, 0, LUART, LUART);

    /* 172 - UART4 Transfer Done
     * 173 - I2C4 Bus Collision Event
     * 174 - I2C4 Slave Event
     * 175 - I2C4 Master Event */
    IPC(43) = PIC32_IPC_IP(LUART, 0, 0, 0);

    /* 176 - SPI5 Fault
     * 177 - SPI5 Receive Done
     * 178 - SPI5 Transfer Done
     * 179 - UART5 Fault */
    IPC(44) = PIC32_IPC_IP(LSPI, LSPI, LSPI, LUART);

    /* 180 - UART5 Receive Done
     * 181 - UART5 Transfer Done
     * 182 - I2C5 Bus Collision Event
     * 183 - I2C5 Slave Event */
    IPC(45) = PIC32_IPC_IP(LUART, LUART, 0, 0);

    /* 184 - I2C5 Master Event
     * 185 - SPI6 Fault
     * 186 - SPI6 Receive Done
     * 187 - SPI6 Transfer Done */
    IPC(46) = PIC32_IPC_IP(0, LSPI, LSPI, LSPI);

    /* 188 - UART6 Fault
     * 189 - UART6 Receive Done
     * 190 - UART6 Transfer Done
     * 191 - Reserved */
    IPC(47) = PIC32_IPC_IP(LUART, LUART, LUART, 0);

    /* Read processor ID register. */
    cpu.cpuprid = mfc0_PRId();

    /*
     * Enable instruction prefetch.
     */
    PRECON = 2;                 /* Two wait states. */
    PRECONSET = 0x30;           /* Enable predictive prefetch for any address */
}

void
initcpu()
{
    /* disable clock interrupts (until startrtclock()) */
#if 0
    // TODO: pic32
    register volatile struct chiptime *c = Mach_clock_addr;
    c->regb = REGB_DATA_MODE | REGB_HOURS_FORMAT;
    (void) c->regc;
#endif

    /* Enable software interrupts. */
    IECSET(0) = 1 << PIC32_IRQ_CS0;     /* softclock */
    IECSET(0) = 1 << PIC32_IRQ_CS1;     /* softnet */

    /* Safe to turn interrupts on now. */
    spl0();
}

static void
identify_cpu()
{
    unsigned osccon = OSCCON, spllcon = SPLLCON;
    unsigned pllmult = (spllcon >> 16 & 127) + 1;
    unsigned pllidiv = (spllcon >> 8 & 7) + 1;
    unsigned pllodiv = "\2\2\4\10\20\40\40\40"[spllcon >> 24 & 7];
    static const char *poscmod[] = { "external clock", "(reserved)",
                                     "crystal", "(disabled)" };

    printf("cpu: %s rev A%u, %u MHz\n",
        cpu_model, DEVID >> 28, CPU_KHZ/1000);

    /* COSC: current oscillator selection bits */
    printf("oscillator: ");
    switch (osccon >> 12 & 7) {
    case 0:
    case 7:
        printf("internal Fast RC, divided\n");
        break;
    case 1:
        printf("system PLL div 1:%d mult x%d\n",
                pllidiv * pllodiv, pllmult);
        break;
    case 2:
        printf("%s\n", poscmod [DEVCFG1 >> 8 & 3]);
        break;
    case 3:
        printf("reserved\n");
        break;
    case 4:
        printf("secondary\n");
        break;
    case 5:
        printf("internal Low-Power RC\n");
        break;
    case 6:
        printf("back-up Fast RC\n");
        break;
    }

