sergev/LiteBSD/sys/mips/pic32/machdep.c
    /*
     * Compute cache sizes.
     */
    unsigned config1 = mfc0_Config1();
    unsigned il = config1 >> 19 & 7;
    unsigned dl = config1 >> 10 & 7;

    machInstCacheSize = 0;
    machDataCacheSize = 0;
    if (il > 0) {
        unsigned is = config1 >> 22 & 7;
        unsigned ia = config1 >> 16 & 7;
        machInstCacheSize = 64 * (1<<is) * 2 * (1<<il) * (ia+1);
    }
    if (dl > 0) {
        unsigned ds = config1 >> 13 & 7;
        unsigned da = config1 >> 7 & 7;
        machDataCacheSize = 64 * (1<<ds) * 2 * (1<<dl) * (da+1);
    }
    if (machInstCacheSize > 0 || machDataCacheSize > 0) {
        printf("cache: %u/%u kbytes\n",
            machInstCacheSize >> 10, machDataCacheSize >> 10);
    }
}

/*
 * File assym.h is incorrect - print the message and panic.
 */
static void
bad_assym(int *error, const char *name, unsigned value)
{
    if (! *error) {
        printf("Fatal error: file sys/mips/include/assym.h is incorrect.\n");
        printf("Please, update the following values and rebuild the kernel:\n");
        *error = 1;
    }
    printf("    #define %s %d\n", name, value);
}

/*
 * Verify assembler symbols.
 * File sys/mips/include/assym.h contains declarations of field offsets
 * of struct proc, user and vmmeter for assembler routines.
 * Here we verify that these values do match our expectations.
 */
static void
verify_assym()
{
    register struct proc *p = 0;
    register struct user *up = 0;
    register struct vmmeter *vm = 0;
    int error = 0;

    /* Offsets for struct proc */
    if (P_FORW != (unsigned)&p->p_forw)
        bad_assym(&error, "P_FORW", (unsigned)&p->p_forw);
    if (P_BACK != (unsigned)&p->p_back)
        bad_assym(&error, "P_BACK", (unsigned)&p->p_back);
    if (P_PRIORITY != (unsigned)&p->p_priority)
        bad_assym(&error, "P_PRIORITY", (unsigned)&p->p_priority);
    if (P_UPTE != (unsigned)p->p_md.md_upte)
        bad_assym(&error, "P_UPTE", (unsigned)p->p_md.md_upte);

    /* Offsets for struct user */
    if (U_PCB_REGS != (unsigned)up->u_pcb.pcb_regs)
        bad_assym(&error, "U_PCB_REGS", (unsigned)up->u_pcb.pcb_regs);
    if (U_PCB_FPREGS != (unsigned)&up->u_pcb.pcb_regs[F0])
        bad_assym(&error, "U_PCB_FPREGS", (unsigned)&up->u_pcb.pcb_regs[F0]);
    if (U_PCB_CONTEXT != (unsigned)&up->u_pcb.pcb_context)
        bad_assym(&error, "U_PCB_CONTEXT", (unsigned)&up->u_pcb.pcb_context);
    if (U_PCB_ONFAULT != (unsigned)&up->u_pcb.pcb_onfault)
        bad_assym(&error, "U_PCB_ONFAULT", (unsigned)&up->u_pcb.pcb_onfault);
    if (U_PCB_SEGTAB != (unsigned)&up->u_pcb.pcb_segtab)
        bad_assym(&error, "U_PCB_SEGTAB", (unsigned)&up->u_pcb.pcb_segtab);

    /* Offsets for struct vmmeter */
    if (V_SWTCH != (unsigned)&vm->v_swtch)
        bad_assym(&error, "V_SWTCH", (unsigned)&vm->v_swtch);

    if (error)
        panic("assym");
}

/*
 * cpu_startup: allocate memory for variable-sized tables,
 * initialize cpu, and do autoconfiguration.
 */
void
cpu_startup()
{
    register unsigned i;
    int base, residual;
    vm_offset_t minaddr, maxaddr;
    vm_size_t size;

    /*
     * Good {morning,afternoon,evening,night}.
     */
    printf(version);
    identify_cpu();
    verify_assym();
    printf("real mem = %d kbytes\n", ctob(physmem) >> 10);
#if 0
printf("callout  = %08x, %u entries, %u bytes\n", callout, ncallout, ncallout * sizeof(struct callout));
printf("swapmap  = %08x, %u entries, %u bytes\n", swapmap, nswapmap, nswapmap * sizeof(struct map));
printf("shmsegs  = %08x, %u entries, %u bytes\n", shmsegs, shminfo.shmmni, shminfo.shmmni * sizeof(struct shmid_ds));
printf("swbuf    = %08x, %u entries, %u bytes\n", swbuf, nswbuf, nswbuf * sizeof(struct buf));
printf("buf      = %08x, %u entries, %u bytes\n", buf, nbuf, nbuf * sizeof(struct buf));
printf("Sysmap   = %08x, %u entries, %u bytes\n", Sysmap, Sysmapsize, Sysmapsize * sizeof(pt_entry_t));
printf("pmap_attributes = %08x, %u entries, %u bytes\n", pmap_attributes, physmem, physmem);
printf("pv_table = %08x, %u entries, %u bytes\n", pv_table, pv_tabsz, pv_tabsz * 12);

printf("avail_start = %08x, avail_end = %08x\n", avail_start, avail_end);
#endif

    /*
     * Allocate virtual address space for file I/O buffers.
     * Note they are different than the array of headers, 'buf',
     * and usually occupy more virtual memory than physical.
     */
    size = MAXBSIZE * nbuf;
    buffer_map = kmem_suballoc(kernel_map, (vm_offset_t *)&buffers,
                   &maxaddr, size, TRUE);
    minaddr = (vm_offset_t)buffers;
    if (vm_map_find(buffer_map, vm_object_allocate(size), (vm_offset_t)0,
            &minaddr, size, FALSE) != KERN_SUCCESS)
        panic("startup: cannot allocate buffers");
    base = bufpages / nbuf;
    residual = bufpages % nbuf;
    for (i = 0; i < nbuf; i++) {
        vm_size_t curbufsize;
        vm_offset_t curbuf;

        /*
         * First <residual> buffers get (base+1) physical pages
         * allocated for them.  The rest get (base) physical pages.
         *
         * The rest of each buffer occupies virtual space,
         * but has no physical memory allocated for it.
         */
        curbuf = (vm_offset_t)buffers + i * MAXBSIZE;
        curbufsize = CLBYTES * (i < residual ? base+1 : base);
        vm_map_pageable(buffer_map, curbuf, curbuf+curbufsize, FALSE);
        vm_map_simplify(buffer_map, curbuf);
    }

    /*
     * Allocate a submap for physio
     */
    phys_map = kmem_suballoc(kernel_map, &minaddr, &maxaddr,
                 VM_PHYS_SIZE, TRUE);
    /*
     * Finally, allocate mbuf pool.  Since mclrefcnt is an off-size
     * we use the more space efficient malloc in place of kmem_alloc.
     */
    mclrefcnt = (char *)malloc(NMBCLUSTERS+CLBYTES/MCLBYTES,
                   M_MBUF, M_NOWAIT);
    bzero(mclrefcnt, NMBCLUSTERS+CLBYTES/MCLBYTES);
    mb_map = kmem_suballoc(kernel_map, (vm_offset_t *)&mbutl, &maxaddr,
                   VM_MBUF_SIZE, FALSE);
    /*
     * Initialize callouts
     */
    callfree = callout;
    for (i = 1; i < ncallout; i++)
        callout[i-1].c_next = &callout[i];
    callout[i-1].c_next = NULL;

    printf("avail mem = %d kbytes\n", ptoa(cnt.v_free_count) >> 10);
    printf("using %d buffers containing %d bytes of memory\n",
        nbuf, bufpages * CLBYTES);
    /*
     * Set up CPU-specific registers, cache, etc.
     */
    initcpu();

